Autodesk.Revit.DB.Electrical.Wire.GetVertex(System.Int32)
Gets the position of an existing vertex.
index:
The index of the existing vertex. Should be between 0 and Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices.
Returns:
The position of the vertex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index should be between 0 and the number of vertices of the wire.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.ConnectTo(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects the wire to other elements.
startConnectorTo:
The connector that the start connector of the wire connects to.
endConnectorTo:
The connector that the end connector of the wire connects to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
startConnectorTo cannot be connected to a wire, as it is not an electrical connector.
-or-
endConnectorTo cannot be connected to a wire, as it is not an electrical connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot connect the wire to the start connector or the end connector.
Since:
2015